In [7]:
import pandas as pd
dict1 = {
   "name": ['Dhruv', 'Yuv', 'Tanish', 'Dhairya'],
    "age": ['20', '19', '18', '21'],
    "marks": ['95', '90', '99', '50']
}

In [8]:
df = pd.DataFrame(dict1)

In [9]:
df

      name age marks
0    Dhruv  20    95
1      Yuv  19    90
2   Tanish  18    99
3  Dhairya  21    50

In [10]:
df.to_csv('friends.csv')